{
  "Title": "The Vinki",
  "Description": "[b]Play as an angsty teen wearing rail-grinding shoes and spraying graffiti to enact revenge on 5P.[/b]\r\n\r\n[h1][url=https://steamcommunity.com/sharedfiles/filedetails/?id=3009407468]GUIDE ON CONTROLS \u002B HOW TO INSERT CUSTOM IMAGES![/url][/h1]\r\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3009407468\r\n\r\n[h2][url=https://github.com/OlayColay/TheVinki/releases]Manual Installation[/url][/h2]\r\nhttps://github.com/OlayColay/TheVinki/releases\r\n\r\n[img]https://i.imgur.com/9EviGd5.gif[/img]\r\n\r\n[img]https://i.imgur.com/fOCUaI1.gif[/img]\r\n\r\n[img]https://i.imgur.com/dwGJtYC.gif[/img]\r\n\r\n[h1]Story[/h1]\r\nOnce upon a time in the sprawling world of Rain World, there lived a slugcat named The Vinki. He was a mischievous and artistic slugcat who had a knack for graffiti, and was inspired by the music he listen to from his RainPods(tm). Every wall, pipe, and surface in his vicinity became his canvas, as he painted vibrant murals that brought color to the gloomy world.\r\n\r\nHowever, The Vinki\u0027s life took a sad turn when he encountered Five Pebbles, a notorious and eccentric iterator known for his strict adherence to rules. It was an unfortunate meeting that forever changed The Vinki\u0027s perception of the world. Five Pebbles, in his unyielding quest for order, found one of The Vinki\u0027s graffiti pieces and decided to erase it with a single stroke of his overseer\u0027s laser.\r\n\r\nThe Vinki was devastated. His masterpiece was gone, reduced to mere dust. The pain of betrayal seeped deep into his slugcat soul. But he was determined to turn his sadness into something extraordinary.\r\n\r\nAs he wandered through the ruins and remnants of the Rain World, The Vinki stumbled upon a hidden alcove. Within it lay a forgotten artifact known as Soap shoes. These shoes were unlike anything he had ever seen before. They were infused with a long-lost technology that allowed the wearer to effortlessly grind rails and poles.\r\n\r\nThe Vinki saw this as a sign—a chance to not only express himself through art but to also seek vengeance in a playful yet hilarious manner. With his newfound grinding abilities, he set out to create his most audacious and eye-catching graffiti pieces yet, leaving them in the most daring and impossible-to-reach places.\r\n\r\nFrom the tops of crumbling skyscrapers to the edges of perilous cliffs, The Vinki\u0027s art became a symbol of rebellion and resilience. He painted with passion, pouring his heart and soul into each stroke, defying the oppressive world around him.\r\n\r\nThe Rain World denizens, initially puzzled by The Vinki\u0027s antics, couldn\u0027t help but be both amused and awestruck. They laughed at the absurdity of seeing a slugcat grinding rails and poles, creating intricate art high above their heads. The Vinki\u0027s graffiti became a beacon of hope, reminding them that even in the darkest of times, there was still room for joy and laughter.\r\n\r\nAnd so, The Vinki, the sad yet funny slugcat, continued to roam the Rain World, leaving his mark wherever he could. He carried the pain of betrayal, but he channeled it into his art, inspiring others to find solace in their own creativity. The Vinki\u0027s saga taught the denizens of Rain World that even amidst sorrow, a little laughter and self-expression could bring about profound healing and transformation.\r\n\r\n[b][url=https://artfight.net/character/3448140.the-vinki-slugcat]Artfight link[/url][/b] \r\n\r\n[h1]To Do[/h1]\r\n[list]\r\n    [*][strike]Grind in 0G[/strike]\r\n    [*][strike]Grind on vines[/strike]\r\n    [*][strike]Graffiti placement mechanic[/strike]\r\n    [*]Graffiti Quest\r\n    [*]Story\r\n    [list]\r\n        [*][strike]Intro Scene[/strike]\r\n        [*][strike]Graffiti Tutorial[/strike]\r\n        [*]Grinding Tutorial\r\n        [*]LttM\r\n        [*]Midway Scene\r\n        [*]Climax Scenario\r\n    [/list]\r\n    [*]World design changes\r\n    [list]\r\n        [*][strike]Graffiti Tutorial[/strike]\r\n        [*]More grind rails in vanilla regions\r\n        [*]New(ish) region\r\n    [/list]\r\n    [*]Art\r\n    [list]\r\n        [*][strike]Character Select[/strike]\r\n        [*][strike]Sleeping[/strike]\r\n        [*][strike]Multiplayer Icons[/strike]\r\n        [*]Quest Screen\r\n        [*]Quest Graffiti\r\n        [*]Acension Ending\r\n        [*]New Ending\r\n    [/list]\r\n    [*]Music\r\n    [list]\r\n        [*][strike]Tutorial[/strike]\r\n        [*][strike]\u0022Vertical Grinding\u0022[/strike]\r\n        [*]TBD\r\n    [/list]\r\n    [*]Custom animations\r\n    [list]\r\n        [*][strike]Crafting[/strike]\r\n        [*]Vertical Grinding\r\n    [/list]\r\n    [*]Trailer\r\n[/list]\r\n\r\n[h1]Credits[/h1]\r\n[list]\r\n[*]The legendary [i]cone._.lord[/i] (on Discord) for the Art!\r\n[*]The brilliant Asagi Ars ([i]MaxDubstep[/i] on Discord) for the original music!\r\n[*]The very-based Tarnished Potato ([i]tarnpot[/i] on Discord) for his level design and for implementing his mod, [url=https://steamcommunity.com/sharedfiles/filedetails/?id=2999289203\u0026searchtext=Fortunate\u002BDevelopment]Fortunate Development[/url] into the mod!\r\n[*]finney2981 ([i]Magik[/i] on Discord) for some awesome graffitis!\r\n[*]My lovely gf for the name idea and help with the original color choices! \u003C3\r\n[*]The teams behind the mod\u0027s dependencies and the awesome people on the RW Discord for making modding Rain World as painless and as fun of a process as possible!\r\n[/list]\r\n\r\n[h1]Known Mod Conflicts[/h1]\r\n[list]\r\n[*][url=https://steamcommunity.com/sharedfiles/filedetails/?id=2957745837]What\u0027s In My Pocket[/url]\r\n[/list]\r\n\r\nLet me know if you have any questions or suggestions! You can also find me on Discord at [i]olaycolay[/i]",
  "ID": "olaycolay.thevinki",
  "Version": "0.8.6",
  "TargetGameVersion": "v1.9.06",
  "Requirements": "slime-cubed.slugbase,improved-input-config,fisobs",
  "RequirementNames": "SlugBase,ImprovedInputConfig,Fisobs",
  "Authors": "OlayColay",
  "Visibility": "Public",
  "Tags": [
    "Campaigns",
    "Game Mechanics",
    "Items",
    "Cosmetics"
  ],
  "WorkshopID": 3001275271,
  "UploadFilesOnly": true,
  "UploadThumbnail": false
}